levizh/hc32f4a8_ddl_rtt/hc32_ll_driver/src/hc32_ll_ske.c
/**
 *******************************************************************************
 * @file  hc32_ll_ske.c
 * @brief This file provides firmware functions to manage the Symmetric Key
 *        Engine(SKE).
 @verbatim
   Change Logs:
   Date             Author          Notes
   2024-09-13       CDT             First version
 @endverbatim
 *******************************************************************************
 * Copyright (C) 2022-2025, Xiaohua Semiconductor Co., Ltd. All rights reserved.
 *
 * This software component is licensed by XHSC under BSD 3-Clause license
 * (the "License"); You may not use this file except in compliance with the
 * License. You may obtain a copy of the License at:
 *                    opensource.org/licenses/BSD-3-Clause
 *
 *******************************************************************************
 */

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_ll_ske.h"
#include "hc32_ll_utility.h"

/**
 * @addtogroup LL_Driver
 * @{
 */

/**
 * @defgroup LL_SKE SKE
 * @brief SKE Driver Library
 * @{
 */

#if (LL_SKE_ENABLE == DDL_ON)

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/
/**
 * @defgroup SKE_Local_Types SKE Local Types
 * @{
 */

/**
 * @brief SKE CCM mode context structure
 */
typedef struct {
    uint32_t u32Alg;                        /*!< SKE algorithm.
                                                 This parameter can be a value of @ref SKE_Algorithm except SKE_ALG_DES  */
    uint32_t u32CryptoSize;                 /*!< Number of byte of the crypto data. */
    uint32_t u32AadSize;                    /*!< Number of byte of the AAD(Additional Authenticated Data). */
    uint32_t u32MacSize;                    /*!< Number of byte of the MAC(Message Authentication Code). */
    uint32_t u32LengthSize;                 /*!< Number of byte of length field. */
    uint32_t u32AadStartOffset;             /*!< AAD[0] to AAD[u32AadStartOffset-1] is in B1.
                                                 B1 is followed by the remaining part of AAD when block updating. */
    uint32_t u32AadRemainSize;              /*!< The remaining size of AAD. */
    uint8_t au8Buffer[16U];                 /*!< Temporary buffer, may be used to store B0 or B1. */
} stc_ske_ccm_ctx_t;

/**
 * @}
 */

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/**
 * @defgroup SKE_Local_Macros SKE Local Macros
 * @{
 */

/**
 * @defgroup SKE_Check_Parameters_Validity SKE Check Parameters Validity
 * @{
 */
#define IS_ADC_BIT_MASK(x, mask)        (((x) != 0U) && (((x) | (mask)) == (mask)))

#define IS_SKE_DATA_TYPE(x)                                                    \
(   ((x) == SKE_DATA_SWAP_NON)          ||                                     \
    ((x) == SKE_DATA_SWAP_HALF_WORD)    ||                                     \
    ((x) == SKE_DATA_SWAP_BYTE)         ||                                     \
    ((x) == SKE_DATA_SWAP_BIT))

#define IS_SKE_CRYPTO(x)        (((x) == SKE_CRYPTO_ENCRYPT) || ((x) == SKE_CRYPTO_DECRYPT))

#define IS_SKE_ALG(x)           (((x) >= SKE_ALG_AES_128) && ((x) <= SKE_ALG_AES_256))

#define IS_SKE_XCM_MD_ALG(x)    (IS_SKE_ALG(x) && ((x) != SKE_ALG_DES))

#define IS_SKE_MD(x)                                                           \
(   ((x) == SKE_MD_ECB)         ||                                             \
    ((x) == SKE_MD_CBC)         ||                                             \
    ((x) == SKE_MD_CFB)         ||                                             \
    ((x) == SKE_MD_OFB)         ||                                             \
    ((x) == SKE_MD_CTR)         ||                                             \
    ((x) == SKE_MD_CMAC)        ||                                             \
    ((x) == SKE_MD_GCM)         ||                                             \
    ((x) == SKE_MD_CCM))

#define IS_SKE_IV_MD(x)                                                        \
(   ((x) == SKE_MD_CBC)         ||                                             \
    ((x) == SKE_MD_CFB)         ||                                             \
    ((x) == SKE_MD_OFB)         ||                                             \
    ((x) == SKE_MD_CTR)         ||                                             \
    ((x) == SKE_MD_CMAC)        ||                                             \
    ((x) == SKE_MD_GCM)         ||                                             \
    ((x) == SKE_MD_CCM))

#define IS_SKE_BASE_MD(x)                                                      \
(   ((x) == SKE_MD_ECB)         ||                                             \
    ((x) == SKE_MD_CBC)         ||                                             \
    ((x) == SKE_MD_CFB)         ||                                             \
    ((x) == SKE_MD_OFB)         ||                                             \
    ((x) == SKE_MD_CTR))

#define IS_SKE_XCM_MD(x)                                                       \
(   ((x) == SKE_MD_GCM)         ||                                             \
    ((x) == SKE_MD_CCM))

#define IS_SKE_ALG_MD(alg, md)                                                 \
(   (IS_SKE_ALG(alg) && IS_SKE_BASE_MD(md))             ||                     \
    (IS_SKE_ALG(alg) && ((md) == SKE_MD_CMAC))          ||                     \
    (IS_SKE_XCM_MD_ALG(alg) && IS_SKE_XCM_MD(md)))

#define IS_SKE_GCM_MAC_SIZE(x)          ((x) <= 16U)

#define IS_SKE_CCM_MAC_SIZE(x)          ((((x) >= 4U) && ((x) <= 16U)) && (((x) & 0x1U) == 0U))

#define IS_SKE_CCM_L_SIZE(x)            (((x) >= 2U) && ((x) <= 8U))

