levizh/hc32f4a8_ddl_rtt/hc32_ll_driver/src/hc32_ll_ske.c
#define IS_SKE_XCM_MAC_SIZE(md, s)                                             \
(   (((md) == SKE_MD_GCM) && IS_SKE_GCM_MAC_SIZE(s))    ||                     \
    (((md) == SKE_MD_CCM) && IS_SKE_CCM_MAC_SIZE(s)))

#define IS_SKE_FLAG(x)                  IS_ADC_BIT_MASK(x, SKE_FLAG_ALL)
#define IS_SKE_FLAG_CLR(x)              IS_ADC_BIT_MASK(x, SKE_FLAG_CLR_ALL)
/**
 * @}
 */

/**
 * @defgroup SKE_Driver_Const_Value SKE Driver Const Value
 * @{
 */
#define SKE_CFG_INIT_MASK               (SKE_CFG_MODE | SKE_CFG_DATA_TYPE | SKE_CFG_ALG)
#define SKE_TIMEOUT_VAL                 (1000UL)
#define SKE_BLOCK_SIZE_MAX              (SKE_BLOCK_SIZE_16BYTE)
#define SKE_MAC_SIZE_MAX                (SKE_BLOCK_SIZE_16BYTE)

#define SKE_SR1_FLAG                    (SKE_FLAG_BUSY | SKE_FLAG_MID_VALID)

/* RMU timeout value */
#define SKE_RMU_TIMEOUT                 (100U)
/**
 * @}
 */

/**
 * @defgroup SKE_Func_Like_Macro SKE Function Like Macro
 * @{
 */
#define SKE_START()                     WRITE_REG32(bCM_SKE->CTRL_b.START, 1U)
#define SKE_SET_LAST_BLOCK_MARK()       WRITE_REG32(bCM_SKE->DIN_CR_b.LAST, 1U)
#define SKE_RESET_LAST_BLOCK_MARK()     WRITE_REG32(bCM_SKE->DIN_CR_b.LAST, 0U)
#define SKE_CFG_UPD_CMD(cmd)            WRITE_REG32(bCM_SKE->CFG_b.UP_CFG, (cmd))
/**
 * @}
 */

/**
 * @}
 */

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/
/**
 * @defgroup SKE_Local_Variables SKE Local Variables
 * @{
 */
static const uint8_t m_au8SkeAlgBlockSize[] = {0U, 16U, 16U, 8U, 16U, 16U};
static const uint8_t m_au8SkeAlgKeySize[] = {0U, 16U, 16U, 8U, 24U, 32U};
/**
 * @}
 */

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/

/**
 * @defgroup SKE_Local_Functions SKE Local Functions
 * @{
 */
/**
 * @brief  Copy data byte from pu8Src to pu8Dest.
 * @param  [out] pu8Dest                Pointer to destination data buffer.
 * @param  [in]  pu8Src                 Pointer to source data buffer.
 * @param  [in]  u32Size                Size(in byte) of the data to be copied.
 * @retval None
 */
static void SKE_CopyByte(uint8_t *pu8Dest, const uint8_t *pu8Src, uint32_t u32Size)
{
    uint32_t i;
    for (i = 0U; i < u32Size; i++) {
        pu8Dest[i] = pu8Src[i];
    }
}

/**
 * @brief  Set the value of the specified buffer byte by byte.
 * @param  [out] pu8Dest                Pointer to destination data buffer that to be set value.
 * @param  [in]  u8Value                Byte value.
 * @param  [in]  u32Size                Size(in byte) of the data to be set.
 * @retval None
 */
static void SKE_SetByte(uint8_t *pu8Dest, uint8_t u8Value, uint32_t u32Size)
{
    uint32_t i;
    for (i = 0U; i < u32Size; i++) {
        pu8Dest[i] = u8Value;
    }
}

/**
 * @brief  Compare tow buffers byte by byte.
 * @param  [in]  pu8Src1                Pointer to source data buffer1
 * @param  [in]  pu8Src2                Pointer to source data buffer2
 * @param  [in]  u32Size                Size(in byte) of the data to be compared.
 * @retval int32_t:
 *           - LL_OK:                   Two buffers are equal.
 *           - LL_ERR:                  Two buffers are not equal.
 */
static int32_t SKE_CompareByte(const uint8_t *pu8Src1, const uint8_t *pu8Src2, uint32_t u32Size)
{
    uint32_t i;

    for (i = 0U; i < u32Size; i++) {
        if (pu8Src1[i] != pu8Src2[i]) {
            return LL_ERR;
        }
    }

    return LL_OK;
}

/**
 * @brief  Reverse byte array
 * @param  [in]  pu8Src                 Pointer to the source buffer to be reversed byte
 * @param  [out] pu8Out                 Pointer to the buffer to save the source buffer after reversed.
 * @param  [in]  u32Size                Size(in byte) of the data to be reversed.
 * @retval None
 */
static void SKE_ReverseByteArray(const uint8_t *pu8Src, uint8_t *pu8Out, uint32_t u32Size)
{
    uint8_t u8Tmp;
    uint32_t u32Idx;
    uint32_t u32Round = u32Size >> 1U;

    for (u32Idx = 0; u32Idx < u32Round; u32Idx++) {
        u8Tmp = pu8Src[u32Idx];
        pu8Out[u32Idx] = pu8Src[u32Size - 1U - u32Idx];
        pu8Out[u32Size - 1U - u32Idx] = u8Tmp;
    }

    if (((u32Size & 0x1U) != 0U) && (pu8Src != pu8Out)) {
        pu8Out[u32Round] = pu8Src[u32Round];
    }
}

/**
 * @brief SKE update one block of plaintext or ciphertext.
 * @param  [in]  u32Alg                 SKE algorithm.
 *                                      This parameter can be a value of @ref SKE_Algorithm
 *   @arg  SKE_ALG_AES_128:             The algorithm is AES-128.
 *   @arg  SKE_ALG_AES_192:             The algorithm is AES-192.
 *   @arg  SKE_ALG_AES_256:             The algorithm is AES-256.
 *   @arg  SKE_ALG_SM4:                 The algorithm is SM4.
 *   @arg  SKE_ALG_DES:                 The algorithm is DES.
 * @param  [in]  u32Mode                SKE operation mode.
 *                                      This parameter can be a value of @ref SKE_Crypto_Mode
 *   @arg  SKE_MD_ECB:                  Electronic Code Book(ECB) mode.
 *   @arg  SKE_MD_CBC:                  Cipher Block Chaining(CBC) mode.
 *   @arg  SKE_MD_CFB:                  Cipher FeedBack(CFB) mode.
 *   @arg  SKE_MD_OFB:                  Output FeedBack(OFB) mode.
 *   @arg  SKE_MD_CTR:                  Counter(CTR) mode.
 *   @arg  SKE_MD_GCM:                  Galois/Counter Mode(GCM).
 *   @arg  SKE_MD_CCM:                  Generic authenticate-and-encrypt block cipher mode.
 * @param  [in]  pu8In                  Pointer to the plaintext byte buffer if SKE encrypting.
 *                                      Pointer to the ciphertext byte buffer if SKE decrypting.
 * @param  [out] pu8Out                 Pointer to the ciphertext byte buffer if SKE encrypting.
 *                                      Pointer to the plaintext byte buffer if SKE decrypting.
 *                                      Set it to NULL if the output data is not needed.
 * @param  [in]  u8IsLastBlock          For GCM mode and CCM mode only, ignored for other modes.
 *                                      This parameter can be:
 *                                      zero: The specified block is not the last block.
 *                                      non-zero: The specified block is the last block.
 * @retval int32_t:
 *           - LL_OK:                   The specified block updated with no error occurred.
 *           - LL_ERR_INVD_PARAM:       pu8In == NULL
 *           - LL_ERR_TIMEOUT:          SKE calculation timeout.
 */
static int32_t SKE_UpdateOneBlock(uint32_t u32Alg, uint32_t u32Mode, const uint8_t *pu8In, uint8_t *pu8Out, uint8_t u8IsLastBlock)
{
    int32_t i32Ret;

