levizh/hc32f4a8_ddl_rtt/hc32_ll_driver/src/hc32_ll_ske.c
    DDL_ASSERT(IS_SKE_ALG_MD(u32Alg, u32Mode));

    if (pu8In == NULL) {
        return LL_ERR_INVD_PARAM;
    }

    /* Check if last block of GCM/CCM/CMAC */
    if ((u32Mode == SKE_MD_GCM) || (u32Mode == SKE_MD_CCM) || (u32Mode == SKE_MD_CMAC)) {
        if (u8IsLastBlock != 0U) {
            SKE_SET_LAST_BLOCK_MARK();
        }
    }
    (void)SKE_WriteBlock(u32Alg, pu8In);
    /* SKE start */
    SKE_START();
    /* Wait till done */
    i32Ret = SKE_WaitTillDone();
    if (i32Ret != LL_OK) {
        return i32Ret;
    }

    if (pu8Out != NULL) {
        (void)SKE_ReadBlock(u32Alg, pu8Out);
    }
    if ((u32Mode == SKE_MD_GCM) || (u32Mode == SKE_MD_CCM) || (u32Mode == SKE_MD_CMAC)) {
        if (u8IsLastBlock != 0U) {
            SKE_RESET_LAST_BLOCK_MARK();
            if (u32Mode == SKE_MD_CMAC) {
                /* Reset the last block size of CMAC mode */
                CLR_REG32_BIT(CM_SKE->DIN_CR, SKE_DIN_CR_LAST_LEN);
            }
        }
    }

    return LL_OK;
}

/**
 * @brief  GMAC mode initialization preparation
 * @param  [in]  pstcSkeInit            Pointer to a @ref stc_ske_init_t structure value that
 *                                      contains the configuration information for the SKE.
 * @retval int32_t:
 *           - LL_OK:                   No error occurred.
 * @note The IV for CAMC will be set to zero.
 */
static int32_t SKE_CmacPrepareInit(const stc_ske_init_t *pstcSkeInit)
{
    WRITE_REG32(CM_SKE->CFG, 0U);
    return LL_OK;
}

/**
 * @brief  GCM mode initialization preparation
 * @param  [in]  pstcSkeInit            Pointer to a @ref stc_ske_init_t structure value that
 *                                      contains the configuration information for the SKE.
 * @retval int32_t:
 *           - LL_OK:                   No error occurred.
 *           - LL_ERR_INVD_PARAM:       Parameters invalid.
 * @note The IV for GCM use au8Iv[0]~au8Iv[11], the remain bytes will be set to zero.
 */
static int32_t SKE_GcmPrepareInit(const stc_ske_init_t *pstcSkeInit)
{
    if ((pstcSkeInit->pstcGcmInit == NULL) || \
        ((pstcSkeInit->pstcGcmInit->u32AadSize | pstcSkeInit->pstcGcmInit->u32CryptoSize) == 0U)) {
        return LL_ERR_INVD_PARAM;
    }
    /* Check function parameters */
    DDL_ASSERT((pstcSkeInit->pstcGcmInit->u32AadSize | pstcSkeInit->pstcGcmInit->u32CryptoSize) != 0U);

    /* Set AAD bit length */
    SKE_SetAadSize(pstcSkeInit->pstcGcmInit->u32AadSize);

    /* Set crypto bit length */
    SKE_SetCryptoSize(pstcSkeInit->pstcGcmInit->u32CryptoSize);

    return LL_OK;
}

/**
 * @brief  CCM mode initialization preparation
 * @param  [in]  pstcSkeInit            Pointer to a @ref stc_ske_init_t structure value that
 *                                      contains the configuration information for the SKE.
 * @param  [in]  pCtx                   Pointer to a @ref stc_ske_ccm_ctx_t structure
 * @retval int32_t:
 *           - LL_OK:                   No error occurred.
 *           - LL_ERR_INVD_PARAM:       Parameters invalid.
 * @note The IV of CCM will generated from 'pstcContext->u32LengthSize' and 'pstcSkeInit->pu8Nonce'.
 */
static int32_t SKE_CcmPrepareInit(const stc_ske_init_t *pstcSkeInit, stc_ske_ccm_ctx_t *pCtx)
{
    uint32_t u32Tmp;
    uint32_t u32Len = 0U;

    if ((pCtx == NULL) || (pstcSkeInit->pstcCcmInit == NULL) || (pstcSkeInit->pstcCcmInit->pu8Nonce == NULL) || \
        ((pstcSkeInit->pstcCcmInit->u32AadSize | pstcSkeInit->pstcCcmInit->u32CryptoSize) == 0U)) {
        return LL_ERR_INVD_PARAM;
    }

    /* Check function parameters */
    DDL_ASSERT(IS_SKE_CCM_MAC_SIZE(pstcSkeInit->pstcCcmInit->u32MacSize));
    DDL_ASSERT(IS_SKE_CCM_L_SIZE(pstcSkeInit->pstcCcmInit->u32LengthSize));
    DDL_ASSERT(pstcSkeInit->pstcCcmInit->pu8Nonce != NULL);
    DDL_ASSERT((pstcSkeInit->pstcCcmInit->u32AadSize | pstcSkeInit->pstcCcmInit->u32CryptoSize) != 0U);

    /* Check u32CryptoSize */
    u32Tmp = pstcSkeInit->pstcCcmInit->u32CryptoSize;
    while (u32Tmp != 0U) {
        u32Len++;
        u32Tmp >>= 8U;
    }

    DDL_ASSERT(pstcSkeInit->pstcCcmInit->u32LengthSize >= u32Len);
    if (u32Len > pstcSkeInit->pstcCcmInit->u32LengthSize) {
        return LL_ERR_INVD_PARAM;
    }
    /* Initializes the context fields */
    pCtx->u32Alg        = pstcSkeInit->u32Alg;
    pCtx->u32MacSize    = pstcSkeInit->pstcCcmInit->u32MacSize;
    pCtx->u32LengthSize = pstcSkeInit->pstcCcmInit->u32LengthSize;

    /* A0. Caution: IV here is A0 */
    pstcSkeInit->pu8Iv[0U] = (uint8_t)(pCtx->u32LengthSize - 1U);
    SKE_CopyByte(&pstcSkeInit->pu8Iv[1U], pstcSkeInit->pstcCcmInit->pu8Nonce, 15UL - pCtx->u32LengthSize);
    SKE_SetByte(&pstcSkeInit->pu8Iv[16UL - pCtx->u32LengthSize], 0U, pCtx->u32LengthSize);

    pCtx->u32CryptoSize = pstcSkeInit->pstcCcmInit->u32CryptoSize;
    SKE_SetCryptoSize(pstcSkeInit->pstcCcmInit->u32CryptoSize);

    pCtx->u32AadSize = pstcSkeInit->pstcCcmInit->u32AadSize;
    SKE_SetAadSize(pstcSkeInit->pstcCcmInit->u32AadSize);

    return LL_OK;
}

/**
 * @brief  CCM mode get B0.
 * @param  [in]  pCtx                   Pointer to a @ref stc_ske_ccm_ctx_t structure value that
 *                                      contains the context for CCM mode.
 * @param  [in] pu8Nonce                Pointer to a nonce buffer for CCM mode.
 * @retval None
 */
static void SKE_CcmGetB0(stc_ske_ccm_ctx_t *pCtx, const uint8_t *pu8Nonce)
{
    uint8_t au8Tmp[4U];
    /**
     * B0[0]: flag
     * B0[1] ~ B0[15-u32LengthSize]: nonce
     * B0[16-u32LengthSize] ~ B0[15]: u32CryptoSize
     */
    /* Get B0 into pCtx->au8Buffer */
    /* B0 flag */
    pCtx->au8Buffer[0U] = 0U;
    pCtx->au8Buffer[0U] |= ((uint8_t)(((pCtx->u32MacSize - 2U) / 2U) << 3U));
    pCtx->au8Buffer[0U] |= ((uint8_t)(pCtx->u32LengthSize - 1U));

    if (pCtx->u32AadSize > 0U) {
        /* With AAD flag */
        pCtx->au8Buffer[0U] |= 0x40U;
    }

    /* B0 nonce */
    SKE_CopyByte(&pCtx->au8Buffer[1U], pu8Nonce, 15U - pCtx->u32LengthSize);
    SKE_SetByte(&pCtx->au8Buffer[16U - pCtx->u32LengthSize], 0U, pCtx->u32LengthSize);

    /* B0 crypto data byte length, little endian */
    SKE_ReverseByteArray((uint8_t *)(&(pCtx->u32CryptoSize)), au8Tmp, 4U);

    if (pCtx->u32LengthSize <= 4U) {
        SKE_CopyByte(&pCtx->au8Buffer[16U - pCtx->u32LengthSize], &au8Tmp[4U - pCtx->u32LengthSize], pCtx->u32LengthSize);
    } else {
        SKE_CopyByte(&pCtx->au8Buffer[12U], au8Tmp, 4U);
    }
}

/**
 * @brief  CCM mode prepare B1.
 * @param  [in]  pCtx                   Pointer to a @ref stc_ske_ccm_ctx_t structure value that
 *                                      contains the context for CCM mode.
 * @param  [in] pu8Aad                  Pointer to an AAD buffer for CCM mode.
 * @retval None
 */
static void SKE_CcmPrepareB1(stc_ske_ccm_ctx_t *pCtx, const uint8_t *pu8Aad)
{
    uint8_t au8Tmp[4U];

    /* Offset of pCtx->au8Buffer */
    uint32_t u32Offset;
    /* Remain-size of pCtx->au8Buffer */
    uint32_t u32RemainSize;

    /* Little endian */
    SKE_ReverseByteArray((uint8_t *)(&pCtx->u32AadSize), au8Tmp, 4U);

    if (pCtx->u32AadSize < 65280UL) {
        /* 65280: 2^16 - 2^8 */
        SKE_CopyByte(pCtx->au8Buffer, &au8Tmp[2U], 2U);
        u32Offset = 2U;
        /* 16-2 */
        u32RemainSize = 14U;
    } else {
        /* 65280 <= pCtx->u32AadSize < 2^32 */
        pCtx->au8Buffer[0U] = 0xFFU;
        pCtx->au8Buffer[1U] = 0xFEU;
        SKE_CopyByte(&pCtx->au8Buffer[2U], au8Tmp, 4U);
        u32Offset = 6U;
        /* 16-6 */
        u32RemainSize = 10U;
    }

