levizh/hc32f4a8_ddl_rtt/hc32_ll_driver/src/hc32_ll_ske.c
    if (pCtx->u32AadSize <= u32RemainSize) {
        SKE_CopyByte(&pCtx->au8Buffer[u32Offset], pu8Aad, pCtx->u32AadSize);
        u32Offset += pCtx->u32AadSize;
        u32RemainSize = 16U - u32Offset;
        SKE_SetByte(&pCtx->au8Buffer[u32Offset], 0U, u32RemainSize);
        pCtx->u32AadRemainSize  = 0U;
        pCtx->u32AadStartOffset = 0U;
    } else {
        SKE_CopyByte(&pCtx->au8Buffer[u32Offset], pu8Aad, u32RemainSize);
        pCtx->u32AadRemainSize  = pCtx->u32AadSize - u32RemainSize;
        pCtx->u32AadStartOffset = u32RemainSize;
    }
}

/**
 * @brief  Continue to initialize CCM mode.
 * @param  [in]  pstcSkeInit            Pointer to a @ref stc_ske_init_t structure value that
 *                                      contains the configuration information for the SKE.
 * @param  [in]  pCtx                   Pointer to a @ref stc_ske_ccm_ctx_t structure value that
 *                                      contains the context for CCM mode.
 * @retval int32_t:
 *           - LL_OK:                   No error occurred.
 *           - LL_ERR_TIMEOUT:          SKE calculating timeout.
 */
static int32_t SKE_CcmContinueInit(const stc_ske_init_t *pstcSkeInit, stc_ske_ccm_ctx_t *pCtx)
{
    int32_t i32Ret;

    if ((pstcSkeInit->pstcCcmInit == NULL) || (pCtx == NULL)) {
        return LL_ERR_INVD_PARAM;
    }

    /* Get B0, store in pCtx->au8Buffer */
    SKE_CcmGetB0(pCtx, pstcSkeInit->pstcCcmInit->pu8Nonce);

    if (pstcSkeInit->pstcCcmInit->u32AadSize == 0U) {
        SKE_SET_LAST_BLOCK_MARK();
    }

    /* Update B0 */
    i32Ret = SKE_UpdateOneBlock(pstcSkeInit->u32Alg, pstcSkeInit->u32Mode, pCtx->au8Buffer, NULL, 0U);

    if (i32Ret == LL_OK) {
        if (pCtx->u32AadSize == 0U) {
            SKE_RESET_LAST_BLOCK_MARK();
        }
        /* Get B1 if u32AadSize is non-zero, and store in pCtx->au8Buffer */
        if (pstcSkeInit->pstcCcmInit->u32AadSize != 0U) {
            SKE_CcmPrepareB1(pCtx, pstcSkeInit->pstcCcmInit->pu8Aad);
        }
    }

    return i32Ret;
}

/**
 * @brief  SKE internal initialization.
 * @param  [in]  pstcSkeInit            Pointer to a @ref stc_ske_init_t structure value that
 *                                      contains the configuration information for the SKE.
 * @retval int32_t:
 *           - LL_OK:                   No error occurred.
 *           - LL_ERR_INVD_PARAM:       pstcSkeInit == NULL.
 *           - LL_ERR_TIMEOUT:          Expand the key timeout.
 */
static int32_t SKE_InitInternal(const stc_ske_init_t *pstcSkeInit)
{
    /* Enable update configuration */
    SKE_CFG_UPD_CMD(ENABLE);
    /* Write configuration value */
    MODIFY_REG32(CM_SKE->CFG, SKE_CFG_INIT_MASK, pstcSkeInit->u32Mode | pstcSkeInit->u32DataType | pstcSkeInit->u32Alg);
    if (pstcSkeInit->u32Mode == SKE_MD_CMAC) {
        WRITE_REG32(bCM_SKE->CFG_b.DEC, SKE_CRYPTO_ENCRYPT);
    } else {
        WRITE_REG32(bCM_SKE->CFG_b.DEC, pstcSkeInit->u32Crypto);
    }
    SKE_RESET_LAST_BLOCK_MARK();
    /* Set IV according to the mode */
    if (pstcSkeInit->u32Mode != SKE_MD_ECB) {
        (void)SKE_SetIv(pstcSkeInit->u32Alg, pstcSkeInit->u32Mode, pstcSkeInit->pu8Iv);
    }

    /* Set key and expand key */
    (void)SKE_SetKey(pstcSkeInit->u32Alg, pstcSkeInit->pu8Key);
    return SKE_ExpandKey();
}

/**
 * @brief SKE crypto all blocks of plaintext or ciphertext.
 * @param  [in]  u32Alg                 SKE algorithm.
 *                                      This parameter can be a value of @ref SKE_Algorithm
 *   @arg  SKE_ALG_AES_128:             The algorithm is AES-128.
 *   @arg  SKE_ALG_AES_192:             The algorithm is AES-192.
 *   @arg  SKE_ALG_AES_256:             The algorithm is AES-256.
 *   @arg  SKE_ALG_SM4:                 The algorithm is SM4.
 *   @arg  SKE_ALG_DES:                 The algorithm is DES.
 * @param  [in]  u32Mode                SKE operation mode.
 *                                      This parameter can be a value of @ref SKE_Crypto_Mode
 *   @arg  SKE_MD_ECB:                  Electronic Code Book(ECB) mode.
 *   @arg  SKE_MD_CBC:                  Cipher Block Chaining(CBC) mode.
 *   @arg  SKE_MD_CFB:                  Cipher FeedBack(CFB) mode.
 *   @arg  SKE_MD_OFB:                  Output FeedBack(OFB) mode.
 *   @arg  SKE_MD_CTR:                  Counter(CTR) mode.
 *   @arg  SKE_MD_GCM:                  Galois/Counter Mode(GCM).
 *   @arg  SKE_MD_CCM:                  Generic authenticate-and-encrypt block cipher mode.
 * @param  [in]  pu8In                  Pointer to the plaintext byte buffer if SKE encrypting.
 *                                      Pointer to the ciphertext byte buffer if SKE decrypting.
 * @param  [out] pu8Out                 Pointer to the ciphertext byte buffer if SKE encrypting.
 *                                      Pointer to the plaintext byte buffer if SKE decrypting.
 *                                      Set it to NULL if the output data is not needed.
 * @param  [in]  u32CryptoSize          Size of the byte buffer that to be encrypted or decrypted.
 * @retval int32_t:
 *           - LL_OK:                   The specified blocks updated with no error occurred.
 *           - LL_ERR_INVD_PARAM:       pu8In == NULL or u32UpdateSize == 0U or invalid algorithm parameter.
 *           - LL_ERR_TIMEOUT:          SKE calculation timeout.
 * @note If u32UpdateSize % u32BlockSize != 0, the remain data bytes of the last block will be set to zero when encrypting.
 */
static int32_t SKE_CryptoBlocksInternal(uint32_t u32Alg, uint32_t u32Mode, const uint8_t *pu8In, uint8_t *pu8Out, uint32_t u32CryptoSize)
{
    uint8_t u8LastBlockFlag = 1U;
    uint32_t i;
    uint32_t u32BlockSize;
    uint32_t u32RmainSize;
    uint8_t au8LastBlock[SKE_BLOCK_SIZE_MAX] = {0U};
    int32_t i32Ret;

    if ((pu8In == NULL) || (u32CryptoSize == 0U) || (!IS_SKE_ALG_MD(u32Alg, u32Mode))) {
        return LL_ERR_INVD_PARAM;
    }

    if (u32Mode == SKE_MD_CMAC) {
        u8LastBlockFlag = 0U;
    }

    u32BlockSize = m_au8SkeAlgBlockSize[u32Alg];
    u32RmainSize = u32CryptoSize % u32BlockSize;
    if (u32RmainSize == 0U) {
        u32RmainSize = u32BlockSize;
    }
    u32CryptoSize -= u32RmainSize;
    SKE_CopyByte(au8LastBlock, &pu8In[u32CryptoSize], u32RmainSize);

    for (i = 0U; i < u32CryptoSize; i += u32BlockSize) {
        if (pu8Out == NULL) {
            i32Ret = SKE_UpdateOneBlock(u32Alg, u32Mode, &pu8In[i], NULL, 0U);
        } else {
            i32Ret = SKE_UpdateOneBlock(u32Alg, u32Mode, &pu8In[i], &pu8Out[i], 0U);
        }
        if (i32Ret != LL_OK) {
            return i32Ret;
        }
    }

    /* Crypto the last block. */
    i32Ret = SKE_UpdateOneBlock(u32Alg, u32Mode, au8LastBlock, au8LastBlock, u8LastBlockFlag);
    if ((i32Ret == LL_OK) && (pu8Out != NULL)) {
        SKE_CopyByte(&pu8Out[i], au8LastBlock, u32RmainSize);
    }

    return i32Ret;
}

/**
 * @brief GCM mode update AAD all data bytes.
 * @param  [in]  u32Alg                 SKE algorithm.
 *                                      This parameter can be a value of @ref SKE_Algorithm except SKE_ALG_DES
 *   @arg  SKE_ALG_AES_128:             SKE algorithm is AES-128.
 *   @arg  SKE_ALG_AES_192:             SKE algorithm is AES-192.
 *   @arg  SKE_ALG_AES_256:             SKE algorithm is AES-256.
 *   @arg  SKE_ALG_SM4:                 SKE algorithm is SM4.
 * @param  [in]  pu8Aad                 Pointer to the AAD byte buffer.
 * @param  [in]  u32AadSize             Number of byte of the AAD.
 * @retval int32_t:
 *           - LL_OK:                   The AAD updated with no error occurred.
 *           - LL_ERR_BUF_EMPTY:        There is no AAD for the GCM mode.
 *           - LL_ERR_TIMEOUT:          SKE calculation timeout.
 */
static int32_t SKE_GcmUpdateAadBlocks(uint32_t u32Alg, const uint8_t *pu8Aad, uint32_t u32AadSize)
{
    int32_t i32Ret = LL_ERR_BUF_EMPTY;

