levizh/hc32f4a8_ddl_rtt/hc32_ll_driver/src/hc32_ll_ske.c
    DDL_ASSERT(IS_SKE_XCM_MD_ALG(u32Alg));
    if ((u32AadSize != 0U) && (pu8Aad != NULL)) {
        i32Ret = SKE_CryptoBlocksInternal(u32Alg, SKE_MD_GCM, pu8Aad, NULL, u32AadSize);
    }
    return i32Ret;
}

/**
 * @brief CCM mode update AAD all data bytes.
 * @param  [in]  pCtx                   Pointer to a @ref stc_ske_ccm_ctx_t structure value that
 *                                      contains the context for CCM mode.
 * @param  [in]  pu8Aad                 Pointer to the AAD byte buffer.
 * @retval int32_t:
 *           - LL_OK:                   The AAD updated with no error occurred.
 *           - LL_ERR_BUF_EMPTY:        There is no AAD for the CCM mode.
 *           - LL_ERR_INVD_PARAM:       pCtx == NULL.
 *           - LL_ERR_TIMEOUT:          SKE calculation timeout.
 */
static int32_t SKE_CcmUpdateAadBlocks(stc_ske_ccm_ctx_t *pCtx, const uint8_t *pu8Aad)
{
    int32_t i32Ret;

    if (pCtx == NULL) {
        return LL_ERR_INVD_PARAM;
    }

    if ((pu8Aad == NULL) || (pCtx->u32AadSize == 0U)) {
        /* No AAD for the CCM mode */
        return LL_ERR_BUF_EMPTY;
    }

    if (pCtx->u32AadRemainSize == 0U) {
        i32Ret = SKE_UpdateOneBlock(pCtx->u32Alg, SKE_MD_CCM, pCtx->au8Buffer, NULL, 1U);
    } else {
        i32Ret = SKE_UpdateOneBlock(pCtx->u32Alg, SKE_MD_CCM, pCtx->au8Buffer, NULL, 0U);
        if (i32Ret == LL_OK) {
            i32Ret = SKE_CryptoBlocksInternal(pCtx->u32Alg, SKE_MD_CCM, &pu8Aad[pCtx->u32AadStartOffset], \
                                              NULL, pCtx->u32AadRemainSize);
        }
    }

    return i32Ret;
}
/**
 * @}
 */

/**
 * @defgroup SKE_Global_Functions SKE Global Functions
 * @{
 */
/**
 * @brief  Initializes the SKE peripheral according to the specified parameters
 *         in the structure pstcSkeInit.
 * @param  [in]  pstcSkeInit            Pointer to a @ref stc_ske_init_t structure value that
 *                                      contains the configuration information for the SKE.
 * @retval int32_t:
 *           - LL_OK:                   No error occurred.
 *           - LL_ERR_INVD_PARAM:       Parameters invalid.
 *           - LL_ERR_TIMEOUT:          Expand the key timeout.
 */
int32_t SKE_Init(const stc_ske_init_t *pstcSkeInit)
{
    int32_t i32Ret = LL_OK;
    __IO uint32_t u32TimeCount = 0UL;
    stc_ske_ccm_ctx_t stcCcmCtx;

    if ((pstcSkeInit == NULL) || (pstcSkeInit->pu8Key == NULL) || \
        ((pstcSkeInit->u32Mode != SKE_MD_ECB) && (pstcSkeInit->u32Mode != SKE_MD_CMAC) && (pstcSkeInit->pu8Iv == NULL))) {
        return LL_ERR_INVD_PARAM;
    }

    /* Check function parameters */
    DDL_ASSERT(IS_SKE_ALG_MD(pstcSkeInit->u32Alg, pstcSkeInit->u32Mode));
    DDL_ASSERT(IS_SKE_DATA_TYPE(pstcSkeInit->u32DataType));
    DDL_ASSERT(IS_SKE_CRYPTO(pstcSkeInit->u32Crypto));

    while (READ_REG32(bCM_SKE->SR1_b.BUSY) != 0U) {
        u32TimeCount++;
        if (u32TimeCount > SKE_TIMEOUT_VAL) {
            /* SKE is busy, initialization failed. */
            return LL_ERR;
        }
    }

    /* Clear SKE done flag. */
    WRITE_REG32(bCM_SKE->SR2_b.CORE_DONE, 0U);
    /* Preparation for initialization of GCM/CCM/CMAC modes */
    if (pstcSkeInit->u32Mode == SKE_MD_GCM) {
        i32Ret = SKE_GcmPrepareInit(pstcSkeInit);
    } else if (pstcSkeInit->u32Mode == SKE_MD_CCM) {
        i32Ret = SKE_CcmPrepareInit(pstcSkeInit, &stcCcmCtx);
    } else if (pstcSkeInit->u32Mode == SKE_MD_CMAC) {
        i32Ret = SKE_CmacPrepareInit(pstcSkeInit);
    } else {
        /* rsvd */
    }
    if (i32Ret != LL_OK) {
        return i32Ret;
    }

    i32Ret = SKE_InitInternal(pstcSkeInit);
    if (i32Ret == LL_OK) {
        if (pstcSkeInit->u32Mode == SKE_MD_GCM) {
            if ((pstcSkeInit->pstcGcmInit->pu8Aad != NULL) && (pstcSkeInit->pstcGcmInit->u32AadSize > 0U)) {
                i32Ret = SKE_GcmUpdateAadBlocks(pstcSkeInit->u32Alg, pstcSkeInit->pstcGcmInit->pu8Aad, pstcSkeInit->pstcGcmInit->u32AadSize);
            }
        } else if (pstcSkeInit->u32Mode == SKE_MD_CCM) {
            i32Ret = SKE_CcmContinueInit(pstcSkeInit, &stcCcmCtx);
            if ((i32Ret == LL_OK) && (pstcSkeInit->pstcCcmInit->u32AadSize > 0U)) {
                i32Ret = SKE_CcmUpdateAadBlocks(&stcCcmCtx, pstcSkeInit->pstcCcmInit->pu8Aad);
            }
        } else {
        }
    }

    return i32Ret;
}

/**
 * @brief  Set each member of @ref stc_ske_init_t to a default value.
 * @param  [in]  pstcSkeInit            Pointer to a @ref stc_ske_init_t structure
 *                                      whose members will be set to default values.
 * @retval int32_t:
 *           - LL_OK:                   No error occurred.
 *           - LL_ERR_INVD_PARAM:       pstcSkeInit == NULL.
 */
int32_t SKE_StructInit(stc_ske_init_t *pstcSkeInit)
{
    if (pstcSkeInit  == NULL) {
        return LL_ERR_INVD_PARAM;
    }

    pstcSkeInit->u32Alg       = SKE_ALG_AES_128;
    pstcSkeInit->u32Mode      = SKE_MD_ECB;
    pstcSkeInit->u32DataType  = SKE_DATA_SWAP_NON;
    pstcSkeInit->u32Crypto    = SKE_CRYPTO_ENCRYPT;
    pstcSkeInit->pu8Key       = NULL;
    pstcSkeInit->pu8Iv        = NULL;
    pstcSkeInit->pstcGcmInit  = NULL;
    pstcSkeInit->pstcCcmInit  = NULL;

    return LL_OK;
}

/**
 * @brief Deinitialize the SKE peripheral registers to their default reset values.
 * @param  None
 * @retval int32_t:
 *           - LL_OK:                   De-Initialize success.
 *           - LL_ERR_TIMEOUT:          Timeout.
 */
int32_t SKE_DeInit(void)
{
    __IO uint8_t u8TimeOut = 0U;

    /* Check FRST register protect */
    DDL_ASSERT((CM_PWC->FPRC & PWC_FPRC_FPRCB1) == PWC_FPRC_FPRCB1);

    /* Reset CANx */
    WRITE_REG32(bCM_RMU->FRST0_b.SKE, 0UL);

    /* Ensure reset procedure is completed */
    while (READ_REG32(bCM_RMU->FRST0_b.SKE) != 1UL) {
        u8TimeOut++;
        if (u8TimeOut > SKE_RMU_TIMEOUT) {
            return LL_ERR_TIMEOUT;
        }
    }

    return LL_OK;
}

/**
 * @brief Enable or disable update SKE configuration.
 * @param  [in]  enNewState             An @ref en_functional_state_t enumeration value.
 *   @arg  ENABLE:                      Enable update SKE configuration.
 *                                      Update the configuration, SKE uses the new configuration for calculation.
 *   @arg  DISABLE:                     Disable update SKE configuration.
 *                                      Do not update the configuration, SKE uses the last configuration for calculation.
 * @retval None
 */
void SKE_UpdateConfigCmd(en_functional_state_t enNewState)
{
    /* Check function parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));
    SKE_CFG_UPD_CMD(enNewState);
}

/**
 * @brief Set SKE data type
 * @param  [in]  u32DataType            SKE data type.
 *                                      This parameter can be a value of @ref SKE_Data_Type
 *   @arg  SKE_DATA_SWAP_NON:           No swap.
 *   @arg  SKE_DATA_SWAP_HALF_WORD:     Half word swap.
 *   @arg  SKE_DATA_SWAP_BYTE:          Byte swap.
 *   @arg  SKE_DATA_SWAP_BIT:           Bit swap.
 * @retval None
 */
void SKE_SetDataType(uint32_t u32DataType)
{
    /* Check function parameters */
    DDL_ASSERT(IS_SKE_DATA_TYPE(u32DataType));
    MODIFY_REG32(CM_SKE->CFG, SKE_CFG_DATA_TYPE, u32DataType);
}

/**
 * @brief Set SKE encrypting or decrypting.
 * @param  [in]  u32Crypto              SKE encrypting or decrypting.
 *                                      This parameter can be a value of @ref SKE_Crypto_Action
 *   @arg  SKE_CRYPTO_ENCRYPT:          SKE encrypting.
 *   @arg  SKE_CRYPTO_DECRYPT:          SKE decrypting.
 * @retval None
 */
void SKE_SetCrypto(uint32_t u32Crypto)
{
    /* Check function parameters */
    DDL_ASSERT(IS_SKE_CRYPTO(u32Crypto));
    WRITE_REG32(bCM_SKE->CFG_b.DEC, u32Crypto);
}

/**
 * @brief Set SKE Algorithm.
 * @param  [in]  u32Alg                 SKE algorithm.
 *   @arg  SKE_ALG_AES_128:             Select AES-128 as SKE algorithm.
 *   @arg  SKE_ALG_AES_192:             Select AES-192 as SKE algorithm.
 *   @arg  SKE_ALG_AES_256:             Select AES-256 as SKE algorithm.
 *   @arg  SKE_ALG_SM4:                 Select SM4 as SKE algorithm.
 *   @arg  SKE_ALG_DES:                 Select DES as SKE algorithm.
 * @retval None
 */
void SKE_SetAlgorithm(uint32_t u32Alg)
{
    /* Check function parameters */
    DDL_ASSERT(IS_SKE_ALG(u32Alg));
    MODIFY_REG32(CM_SKE->CFG, SKE_CFG_ALG, u32Alg);
}

/**
 * @brief Set SKE operation mode
 * @param  [in]  u32Mode                SKE operation mode.
 *                                      This parameter can be a value of @ref SKE_Crypto_Mode
 *   @arg  SKE_MD_ECB:                  Electronic Code Book(ECB) mode.
 *   @arg  SKE_MD_CBC:                  Cipher Block Chaining(CBC) mode.
 *   @arg  SKE_MD_CFB:                  Cipher FeedBack(CFB) mode.
 *   @arg  SKE_MD_OFB:                  Output FeedBack(OFB) mode.
 *   @arg  SKE_MD_CTR:                  Counter(CTR) mode.
 *   @arg  SKE_MD_GCM:                  Galois/Counter Mode(GCM).
 *   @arg  SKE_MD_CCM:                  Generic authenticate-and-encrypt block cipher mode.
 * @retval None
 */
void SKE_SetMode(uint32_t u32Mode)
{
    /* Check function parameters */
    DDL_ASSERT(IS_SKE_MD(u32Mode));
    /* Update operation mode */
    MODIFY_REG32(CM_SKE->CFG, SKE_CFG_MODE, u32Mode);
}

/**
 * @brief Set the mark of the last block.
 * @param  None
 * @retval None
 */
void SKE_SetLastBlockMark(void)
{
    SKE_SET_LAST_BLOCK_MARK();
}

/**
 * @brief Reset the mark of the last block.
 * @param  None
 * @retval None
 */
void SKE_ResetLastBlockMark(void)
{
    SKE_RESET_LAST_BLOCK_MARK();
}

/**
 * @brief Set CMAC mode last block size in byte
 * @param  [in]  u32Size                Size of the last block of CMAC mode in byte.
 * @retval None
 */
void SKE_SetCmacLastBlockSize(uint32_t u32Size)
{
    WRITE_REG32(CM_SKE->DIN_CR, u32Size << 3U);
}

/**
 * @brief Reset CMAC mode last block size
 * @param  None
 * @retval None
 */
void SKE_ResetCmacLastBlockSize(void)
{
    CLR_REG32_BIT(CM_SKE->DIN_CR, SKE_DIN_CR_LAST_LEN);
}

/**
 * @brief  Set SKE key.
 * @param  [in]  u32Alg                 SKE algorithm.
 *                                      This parameter can be a value of @ref SKE_Algorithm
 *   @arg  SKE_ALG_AES_128:             SKE algorithm is AES-128.
 *   @arg  SKE_ALG_AES_192:             SKE algorithm is AES-192.
 *   @arg  SKE_ALG_AES_256:             SKE algorithm is AES-256.
 *   @arg  SKE_ALG_SM4:                 SKE algorithm is SM4.
 *   @arg  SKE_ALG_DES:                 SKE algorithm is DES.
 * @param  [in]  pu8Key                 Pointer to the key buffer.
 * @retval int32_t:
 *           - LL_OK:                   No error occurred.
 *           - LL_ERR_INVD_PARAM:       pu8Key == NULL or invalid algorithm parameter.
 * @note The input key is only valid when CFG.UP_CFG is 1.
 */
int32_t SKE_SetKey(uint32_t u32Alg, const uint8_t *pu8Key)
{
    uint8_t i;
    uint8_t u8WordSize;
    __IO uint32_t *regKR = &CM_SKE->KEY1;
    const uint32_t *pu32Key = (const uint32_t *)((uint32_t)pu8Key);

