levizh/hc32f4a8_ddl_rtt/hc32_ll_driver/src/hc32_ll_ske.c
    if ((pu8Key == NULL) || (!IS_SKE_ALG(u32Alg))) {
        return LL_ERR_INVD_PARAM;
    }

    u8WordSize = m_au8SkeAlgKeySize[u32Alg] / 4U;
    /* Write KEY registers */
    for (i = 0U; i < u8WordSize; i++) {
        regKR[i] = pu32Key[i];
    }

    return LL_OK;
}

/**
 * @brief  SKE expand key.
 * @param  None
 * @retval int32_t:
 *           - LL_OK:                   SKE calculating done successfully.
 *           - LL_ERR_TIMEOUT:          SKE calculating timeout.
 * @note Call after SKE_SetCrypto() and SKE_SetAlgorithm(), and the key is already set.
 */
int32_t SKE_ExpandKey(void)
{
    int32_t i32Ret;

    /* Enable configuration update */
    SKE_CFG_UPD_CMD(ENABLE);
    /* Expand key */
    SKE_START();

    /* Wait operation done */
    i32Ret = SKE_WaitTillDone();
    if (i32Ret == LL_OK) {
        /* Disable configuration update */
        SKE_CFG_UPD_CMD(DISABLE);
    }

    return i32Ret;
}

/**
 * @brief  Set SKE IV.
 * @param  [in]  u32Alg                 SKE algorithm.
 *                                      This parameter can be a value of @ref SKE_Algorithm
 *   @arg  SKE_ALG_AES_128:             SKE algorithm is AES-128.
 *   @arg  SKE_ALG_AES_192:             SKE algorithm is AES-192.
 *   @arg  SKE_ALG_AES_256:             SKE algorithm is AES-256.
 *   @arg  SKE_ALG_SM4:                 SKE algorithm is SM4.
 *   @arg  SKE_ALG_DES:                 SKE algorithm is DES.
 * @param  [in]  u32Mode                SKE crypto mode.
 *                                      This parameter can be a value of @ref SKE_Crypto_Mode except SKE_MD_ECB
 *   @arg  SKE_MD_CBC:                  Cipher Block Chaining(CBC) mode.
 *   @arg  SKE_MD_CFB:                  Cipher FeedBack(CFB) mode, CFB-128 only.
 *   @arg  SKE_MD_OFB:                  Output FeedBack(OFB) mode.
 *   @arg  SKE_MD_CTR:                  Counter(CTR) mode.
 *   @arg  SKE_MD_GCM:                  Galois/Counter Mode(GCM).
 *   @arg  SKE_MD_CCM:                  Generic authenticate-and-encrypt block cipher mode.
 * @param  [in]  pu8Iv                  Pointer to the IV byte buffer.
 * @retval int32_t:
 *           - LL_OK:                   No error occurred.
 *           - LL_ERR_INVD_PARAM:       pu8Iv == NULL or invalid algorithm parameter.
 */
int32_t SKE_SetIv(uint32_t u32Alg, uint32_t u32Mode, const uint8_t *pu8Iv)
{
    uint8_t i;
    uint32_t u32IvSize;
    uint32_t au32Iv[4U] = {0U};
    __IO uint32_t *regIV = &CM_SKE->IV1;

    if ((pu8Iv == NULL) || (!IS_SKE_ALG_MD(u32Alg, u32Mode))) {
        return LL_ERR_INVD_PARAM;
    }

    /* Check function parameters */
    DDL_ASSERT(IS_SKE_IV_MD(u32Mode));

    if (u32Mode == SKE_MD_GCM) {
        u32IvSize = SKE_IV_SIZE_12BYTE;
    } else {
        u32IvSize = m_au8SkeAlgBlockSize[u32Alg];
    }

    if (u32Mode != SKE_MD_CMAC) {
        SKE_CopyByte((uint8_t *)au32Iv, pu8Iv, u32IvSize);
    }

    /* Write IV registers */
    for (i = 0U; i < 4U; i++) {
        regIV[i] = au32Iv[i];
    }

    return LL_OK;
}

/**
 * @brief  Set SKE all IV registers to zero.
 * @param  None
 * @retval None
 */
void SKE_ResetIv(void)
{
    CLR_REG32(CM_SKE->IV1);
    CLR_REG32(CM_SKE->IV2);
    CLR_REG32(CM_SKE->IV3);
    CLR_REG32(CM_SKE->IV4);
}

/**
 * @brief  Set SKE AAD size.
 * @param  [in] u32AadSize              Number of byte of the AAD.
 * @retval None
 * @note Just for CCM and GCM mode.
 */
void SKE_SetAadSize(uint32_t u32AadSize)
{
    WRITE_REG32(CM_SKE->AAD1, (u32AadSize << 3U) & 0xFFFFFFF8UL);
    WRITE_REG32(CM_SKE->AAD2, (u32AadSize >> 29U) & 0x7UL);
}

/**
 * @brief  Set SKE crypto size.
 * @param  [in] u32CryptoSize           Number of byte of the crypto data.
 * @retval None
 * @note Just for CCM and GCM mode.
 */
void SKE_SetCryptoSize(uint32_t u32CryptoSize)
{
    WRITE_REG32(CM_SKE->CLEN1, (u32CryptoSize << 3U) & 0xFFFFFFF8UL);
    WRITE_REG32(CM_SKE->CLEN2, (u32CryptoSize >> 29U) & 0x7UL);
}

/**
 * @brief  Get block size of the specified algorithm
 * @param  [in]  u32Alg                 SKE algorithm.
 *                                      This parameter can be a value of @ref SKE_Algorithm
 *   @arg  SKE_ALG_AES_128:             SKE algorithm is AES-128.
 *   @arg  SKE_ALG_AES_192:             SKE algorithm is AES-192.
 *   @arg  SKE_ALG_AES_256:             SKE algorithm is AES-256.
 *   @arg  SKE_ALG_SM4:                 SKE algorithm is SM4.
 *   @arg  SKE_ALG_DES:                 SKE algorithm is DES.
 * @retval An uint8_t type value of block size. Return 0 means invalid algorithm parameter.
 */
uint8_t SKE_GetBlockSize(uint32_t u32Alg)
{
    if (IS_SKE_ALG(u32Alg)) {
        return m_au8SkeAlgBlockSize[u32Alg];
    } else {
        return 0U;
    }
}

/**
 * @brief  Input one SKE block.
 * @param  [in]  pu8In                  Pointer to the plaintext or ciphertext in byte buffer.
 * @param  [in]  u32Alg                 SKE algorithm.
 *                                      This parameter can be a value of @ref SKE_Algorithm
 *   @arg  SKE_ALG_AES_128:             SKE algorithm is AES-128.
 *   @arg  SKE_ALG_AES_192:             SKE algorithm is AES-192.
 *   @arg  SKE_ALG_AES_256:             SKE algorithm is AES-256.
 *   @arg  SKE_ALG_SM4:                 SKE algorithm is SM4.
 *   @arg  SKE_ALG_DES:                 SKE algorithm is DES.
 * @retval int32_t:
 *           - LL_OK:                   No error occurred.
 *           - LL_ERR_INVD_PARAM:       pu8In == NULL or invalid algorithm parameter.
 */
int32_t SKE_WriteBlock(uint32_t u32Alg, const uint8_t *pu8In)
{
    const uint32_t *pu32In = (const uint32_t *)((uint32_t)pu8In);
    __IO uint32_t *regDIN  = &CM_SKE->DIN1;

    if ((pu8In == NULL) || (!IS_SKE_ALG(u32Alg))) {
        return LL_ERR_INVD_PARAM;
    }

    regDIN[0U] = pu32In[0U];
    regDIN[1U] = pu32In[1U];
    if (m_au8SkeAlgBlockSize[u32Alg] == SKE_BLOCK_SIZE_16BYTE) {
        /* For AES/SM4 */
        regDIN[2U] = pu32In[2U];
        regDIN[3U] = pu32In[3U];
    }

    return LL_OK;
}

/**
 * @brief  Read one SKE block.
 * @param  [out] pu8Out                 One block output of SKE in byte buffer
 * @param  [in]  u32Alg                 SKE algorithm.
 *                                      This parameter can be a value of @ref SKE_Algorithm
 *   @arg  SKE_ALG_AES_128:             SKE algorithm is AES-128.
 *   @arg  SKE_ALG_AES_192:             SKE algorithm is AES-192.
 *   @arg  SKE_ALG_AES_256:             SKE algorithm is AES-256.
 *   @arg  SKE_ALG_SM4:                 SKE algorithm is SM4.
 *   @arg  SKE_ALG_DES:                 SKE algorithm is DES.
 * @retval int32_t:
 *           - LL_OK:                   No error occurred.
 *           - LL_ERR_INVD_PARAM:       pu8Out == NULL or invalid algorithm parameter.
 */
int32_t SKE_ReadBlock(uint32_t u32Alg, uint8_t *pu8Out)
{
    uint32_t *pu32Out     = (uint32_t *)((uint32_t)pu8Out);
    __I uint32_t *regDOUT = &CM_SKE->DOUT1;

    if ((pu8Out == NULL) || (!IS_SKE_ALG(u32Alg))) {
        return LL_ERR_INVD_PARAM;
    }

    pu32Out[0U] = regDOUT[0U];
    pu32Out[1U] = regDOUT[1U];
    if (m_au8SkeAlgBlockSize[u32Alg] == SKE_BLOCK_SIZE_16BYTE) {
        /* For AES/SM4 */
        pu32Out[2U] = regDOUT[2U];
        pu32Out[3U] = regDOUT[3U];
    }

    return LL_OK;
}

/**
 * @brief  Read one middle IV block.
 * @param  [out] pu8Out                 One block output of middle IV in byte buffer
 * @retval int32_t:
 *           - LL_OK:                   No error occurred.
 *           - LL_ERR_INVD_PARAM:       pu8Out == NULL
 */
int32_t SKE_ReadMidIv(uint8_t *pu8Out)
{
    uint32_t *pu32Out     = (uint32_t *)((uint32_t)pu8Out);
    __I uint32_t *regDOUT = &CM_SKE->MID_IV1;

    if (pu8Out == NULL) {
        return LL_ERR_INVD_PARAM;
    }

    pu32Out[0U] = regDOUT[0U];
    pu32Out[1U] = regDOUT[1U];
    pu32Out[2U] = regDOUT[2U];
    pu32Out[3U] = regDOUT[3U];

    return LL_OK;
}

/**
 * @brief Enable or disable SKE interrupt.
 * @param  [in]  enNewState             An @ref en_functional_state_t enumeration value.
 *   @arg  ENABLE:                      Enable SKE interrupt.
 *   @arg  DISABLE:                     Disable SKE interrupt.
 * @retval None
 */
void SKE_IntCmd(en_functional_state_t enNewState)
{
    /* Check function parameters */
    DDL_ASSERT(IS_FUNCTIONAL_STATE(enNewState));
    WRITE_REG32(bCM_SKE->CFG_b.IRQEN, enNewState);
}

/**
 * @brief Start SKE. When CFG.UP_CFG is 1, start update SKE configuration.
 *        When CFG.UP_CFG is 0, start SKE calculation.
 * @param  None
 * @retval None
 */
void SKE_Start(void)
{
    SKE_START();
}

/**
 * @brief  Wait till SKE calculating done
 * @param  None
 * @retval int32_t:
 *           - LL_OK:                   SKE calculating done successfully.
 *           - LL_ERR_TIMEOUT:          SKE calculating timeout.
 */
int32_t SKE_WaitTillDone(void)
{
    uint32_t u32Busy;
    uint32_t u32Done;
    __IO uint32_t u32TimeCount = 0UL;

