levizh/hc32f4a8_ddl_rtt/hc32_ll_driver/src/hc32_ll_ske.c
    for (;;) {
        u32Busy = READ_REG32(bCM_SKE->SR1_b.BUSY);
        u32Done = READ_REG32(bCM_SKE->SR2_b.CORE_DONE);
        if ((u32Done != 0U) && (u32Busy == 0U)) {
            WRITE_REG32(bCM_SKE->SR2_b.CORE_DONE, 0U);
            break;
        }
        u32TimeCount++;
        if (u32TimeCount > SKE_TIMEOUT_VAL) {
            return LL_ERR_TIMEOUT;
        }
    }

    return LL_OK;
}

/**
 * @brief  Get the status of the specified SKE flag.
 * @param  [in]  u32Flag                SKE status flag.
 *                                      This parameter can be a value of @ref SKE_Status_Flag
 * @retval An @ref en_flag_status_t enumeration type value.
 */
en_flag_status_t SKE_GetStatus(uint32_t u32Flag)
{
    en_flag_status_t enStatus = RESET;

    DDL_ASSERT(IS_SKE_FLAG(u32Flag));

    /* If one of the specified flags is set, return SET. */
    /* Check SR1 */
    if (READ_REG32_BIT(CM_SKE->SR1, SKE_SR1_FLAG) != 0U) {
        enStatus = SET;
    }
    /* Check SR2 */
    if ((u32Flag & SKE_FLAG_DONE) != 0U) {
        if (READ_REG32(bCM_SKE->SR2_b.CORE_DONE) != 0U) {
            enStatus = SET;
        }
    }

    return enStatus;
}

/**
 * @brief  Clear the status of the specified SKE flag.
 * @param  [in]  u32Flag                SKE status flag.
 *                                      This parameter can be values of @ref SKE_Status_Flag
 *   @arg  SKE_FLAG_MID_VALID:          The middle value is valid.
 *   @arg  SKE_FLAG_DONE:               SKE calculation done.
 * @retval None
 */
void SKE_ClearStatus(uint32_t u32Flag)
{
    DDL_ASSERT(IS_SKE_FLAG_CLR(u32Flag));

    /* Clear SR1 */
    if ((u32Flag & SKE_FLAG_MID_VALID) != 0U) {
        WRITE_REG32(bCM_SKE->SR1_b.MID_O_VALID, 0U);
    }

    /* Clear SR2 */
    if ((u32Flag & SKE_FLAG_DONE) != 0U) {
        WRITE_REG32(CM_SKE->SR2, 0U);
    }
}

/**
 * @brief SKE crypto all blocks of plaintext or ciphertext.
 * @param  [in]  pstcCrypto             Pointer to a @ref stc_ske_crypto_t structure value that
 *                                      contains the information for crypto.
 * @retval int32_t:
 *           - LL_OK:                   The specified blocks updated with no error occurred.
 *           - LL_ERR_INVD_PARAM:       pstcCrypto == NULL or pstcCrypto->pu8In == NULL or pstcCrypto->u32CryptoSize == 0U
 *           - LL_ERR_TIMEOUT:          SKE calculation timeout.
 * @note If pstcCrypto->u32CryptoSize % u32BlockSize != 0, the remain data bytes of the last block will be set to zero when encrypting.
 */
int32_t SKE_CryptoBlocks(stc_ske_crypto_t *pstcCrypto)
{
    if (pstcCrypto == NULL) {
        return LL_ERR_INVD_PARAM;
    }
    return SKE_CryptoBlocksInternal(pstcCrypto->u32Alg, pstcCrypto->u32Mode, \
                                    pstcCrypto->pu8In, pstcCrypto->pu8Out, \
                                    pstcCrypto->u32CryptoSize);
}

/**
 * @brief Get or authenticate the MAC for CMAC mode.
 * @param  [in]  pstcAction             Pointer to a @ref stc_ske_cmac_action_t structure value that
 *                                      contains the information for generate or authenticate the MAC.
 * @retval int32_t:
 *           - LL_OK:                   No error occurred.
 *           - LL_ERR_INVD_PARAM:       pstcAction == NULL or pstcAction->pu8Mac == NULL or pstcAction->u32MacSize == 0U or invalid algorithm parameter.
 *           - LL_ERR_TIMEOUT:          SKE calculation timeout.
 */
int32_t SKE_CmacAction(stc_ske_cmac_action_t *pstcAction)
{
    uint32_t u32MsgSize;
    uint32_t u32BlockSize;
    uint32_t u32RmainSize = 0U;
    int32_t i32Ret = LL_OK;
    __IO uint32_t u32TimeCount = 0U;
    uint8_t au8Buffer[SKE_BLOCK_SIZE_MAX] = {0U};

    if ((pstcAction == NULL) || (pstcAction->pu8Mac == NULL) || \
        (pstcAction->u32MacSize == 0U) || (!IS_SKE_ALG(pstcAction->u32Alg))) {
        return LL_ERR_INVD_PARAM;
    }

    u32MsgSize   = pstcAction->u32MsgSize;
    u32BlockSize = m_au8SkeAlgBlockSize[pstcAction->u32Alg];

    if ((pstcAction->pu8Msg != NULL) && (u32MsgSize > 0U)) {
        u32RmainSize = u32MsgSize % u32BlockSize;
        if (u32RmainSize == 0U) {
            u32RmainSize = u32BlockSize;
        }
        u32MsgSize -= u32RmainSize;
        if (u32MsgSize > 0U) {
            i32Ret = SKE_CryptoBlocksInternal(pstcAction->u32Alg, SKE_MD_CMAC, pstcAction->pu8Msg, NULL, u32MsgSize);
        }
        SKE_CopyByte(au8Buffer, &pstcAction->pu8Msg[u32MsgSize], u32RmainSize);
    }

    if (i32Ret == LL_OK) {
        /* Set the bit size of the last block */
        WRITE_REG32(CM_SKE->DIN_CR, u32RmainSize << 3U);
        /* Update the last block */
        i32Ret = SKE_UpdateOneBlock(pstcAction->u32Alg, SKE_MD_CMAC, au8Buffer, NULL, 1U);
    }

    if (i32Ret == LL_OK) {
        for (;;) {
            if (READ_REG32(bCM_SKE->SR1_b.MID_O_VALID) == 1U) {
                WRITE_REG32(bCM_SKE->SR1_b.MID_O_VALID, 0U);
                (void)SKE_ReadMidIv(au8Buffer);
                if (pstcAction->u32Action == SKE_CMAC_GENERATE) {
                    /* Get the MAC */
                    SKE_CopyByte(pstcAction->pu8Mac, au8Buffer, pstcAction->u32MacSize);
                } else {
                    /* Verify the MAC */
                    i32Ret = SKE_CompareByte(pstcAction->pu8Mac, au8Buffer, pstcAction->u32MacSize);
                }
                break;
            }
            u32TimeCount++;
            if (u32TimeCount > SKE_TIMEOUT_VAL) {
                i32Ret = LL_ERR_TIMEOUT;
                break;
            }
        }
    }

    return i32Ret;
}

/**
 * @brief The final calculation for GCM mode and CCM mode: get or authenticate the MAC for GCM mode and CCM mode.
 * @param  [in]  pstcFinal              Pointer to a @ref stc_ske_xcm_final_t structure value that
 *                                      contains the final calculation information for GCM mode or CCM mode.
 * @retval int32_t:
 *           - LL_OK:                   No error occurred.
 *           - LL_ERR_INVD_PARAM:       pstcFinal == NULL or pstcFinal->pu8Mac > SKE_MAC_SIZE_MAX;
 *           - LL_ERR_TIMEOUT:          SKE calculation timeout.
 *           - LL_ERR:                  MAC authentication failure.
 */
int32_t SKE_XcmFinal(stc_ske_xcm_final_t *pstcFinal)
{
    int32_t i32Ret;
    uint8_t au8Mac[SKE_BLOCK_SIZE_MAX];

    if (pstcFinal == NULL) {
        return LL_ERR_INVD_PARAM;
    }

    DDL_ASSERT(IS_SKE_XCM_MD_ALG(pstcFinal->u32Alg));
    DDL_ASSERT(IS_SKE_XCM_MD(pstcFinal->u32Mode));
    DDL_ASSERT(IS_SKE_CRYPTO(pstcFinal->u32Crypto));
    DDL_ASSERT(IS_SKE_XCM_MAC_SIZE(pstcFinal->u32Mode, pstcFinal->u32MacSize));

    SKE_START();
    i32Ret = SKE_WaitTillDone();
    if (i32Ret == LL_OK) {
        if ((pstcFinal->pu8Mac != NULL) && (pstcFinal->u32MacSize != 0U)) {
            (void)SKE_ReadBlock(pstcFinal->u32Alg, au8Mac);
            if (pstcFinal->u32Crypto == SKE_CRYPTO_ENCRYPT) {
                SKE_CopyByte(pstcFinal->pu8Mac, au8Mac, pstcFinal->u32MacSize);
            } else if (pstcFinal->u32Crypto == SKE_CRYPTO_DECRYPT) {
                i32Ret = SKE_CompareByte(au8Mac, pstcFinal->pu8Mac, pstcFinal->u32MacSize);
            } else {
                /* rsvd */
            }
        }
    }

    return i32Ret;
}

/**
 * @}
 */

#endif /* LL_SKE_ENABLE */

/**
 * @}
 */

/**
 * @}
 */
/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/

